src/tr069/samples/tr069_get_parameter_names_invalid_req.xml

<soapenv:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
      <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
      <cwmp:GetParameterNames>
	<ParameterPath>m.n.p</ParameterPath>
	<NextLevel>0</NextLevel>
      </cwmp:GetParameterNames>
    </soapenv:Body>
</soapenv:Envelope>
